Revit 2027 API
StructuralElementDefinitionData.CenterCurve Property
 The curve lying in the geometrical center of the element.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Curve CenterCurve { get; }
Public ReadOnly Property CenterCurve As Curve
	Get
public:
property Curve^ CenterCurve {
	Curve^ get ();
}
member CenterCurve : Curve with get
Property Value
Curve
See Also
Reference
StructuralElementDefinitionData Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace